#**Trabalhando com Planilhas do Excel em Python usando Pandas**
*- Renoir Sampaio*

In [0]:
# Importando a biblioteca
import pandas as pd

In [0]:
# Leitura dos arquivos
dt1 = pd.read_excel("Aracaju.xlsx")
dt2 = pd.read_excel("Fortaleza.xlsx")
dt3 = pd.read_excel("Natal.xlsx")
dt4 = pd.read_excel("Recife.xlsx")
dt5 = pd.read_excel("Salvador.xlsx")

In [3]:
# Exemplo
dt2.head()

      Cidade       Data  Vendas  LojaID  Qtde
0  Fortaleza 2019-01-01   45.27    1002     2
1  Fortaleza 2019-01-01  115.61    1002     3
2  Fortaleza 2019-02-10   35.33    1004     3
3  Fortaleza 2019-02-10   20.95    1004     6
4  Fortaleza 2019-01-01   14.25    1004     6

In [0]:
# Concatenação dos arquivos
dt = pd.concat([dt1,dt2,dt3,dt4,dt5])

In [5]:
# 5 primeiras linhas
dt.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
# 5 últimas linhas
dt.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
# Amostra aleatória
dt.sample(5)

       Cidade       Data  Vendas  LojaID  Qtde
61    Aracaju 2018-01-01   39.80    1520     6
39  Fortaleza 2019-01-01  176.51    1005     1
22  Fortaleza 2019-01-01  150.32    1005     1
26    Aracaju 2018-01-01    6.98    1521    10
0    Salvador 2018-01-01   31.06    1037     3

In [8]:
# Verificação do tipo de dado de cada coluna
dt.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [0]:
# Alterando o tipo de dado da coluna LojaID
dt["LojaID"] = dt["LojaID"].astype("object")

In [10]:
# Verificação do tipo de dado de cada coluna novamente
dt.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
# Consultando linhas com valores nulos
dt.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [0]:
# Substituindo os valores nulos pela média da coluna "Vendas"
dt["Vendas"].fillna(dt["Vendas"].mean(), inplace=True)

In [13]:
# Média dos valores de vendas
dt["Vendas"].mean()

122.61180089485438

In [14]:
# Consultando linhas com valores nulos novamente
dt.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [15]:
# Amostra aleatória
dt.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
58    Salvador 2019-01-01   20.64   1037     2
56     Aracaju 2018-01-01   41.90   1523     6
3     Salvador 2019-02-10  176.34   1037     3
83   Fortaleza 2019-01-01    3.88   1002     6
84       Natal 2019-01-02   22.99   1036     1
45       Natal 2019-03-11  431.00    852     3
111    Aracaju 2018-01-01   24.25   1523     1
123     Recife 2019-03-02   20.22    981     6
75     Aracaju 2018-01-01  160.64   1523     9
195   Salvador 2019-01-02   44.89   1036     3
210   Salvador 2019-01-02  197.64   1035     1
175   Salvador 2019-01-02   16.53   1036     2
90    Salvador 2019-01-01  100.54   1036     2
158   Salvador 2019-01-02  183.64   1037     3
130      Natal 2019-01-02   59.78   1036     1

In [0]:
# Substituindo os valores nulos por zero
dt["Vendas"].fillna(0, inplace=True)

In [0]:
# Apagando as linhas com valores nulos
dt.dropna(inplace=True)

In [0]:
# Apagando as linhas com valores nulos com base apenas na coluna determinanda
dt.dropna(subset=["Vendas"], inplace=True)

In [0]:
# Removendo linhas se e somente se estiver com valores faltantes em todas as colunas
dt.dropna(how="all", inplace=True)

In [0]:
# Criando a coluna de "Receita"
dt["Receita"] = dt["Vendas"].mul(dt["Qtde"])

In [21]:
dt.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [0]:
# Criando a coluna de "Receita/Vendas"
dt["Receita/Vendas"] = dt["Receita"] / dt["Vendas"]

In [23]:
dt.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [24]:
# Retornando a maior receita
dt["Receita"].max()

3544.0

In [25]:
# Retornando a menor receita
dt["Receita"].min()

3.34

In [26]:
# Primeiros "x" na coluna desejada
dt.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [27]:
# Últimas "x" na coluna desejada
dt.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [28]:
# Agrupamento por colunas desejadas
dt.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [29]:
# Ordenando o conjunto de dados
dt.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

In [0]:
# Trasnformando a coluna de data em tipo inteiro
dt["Data"] = dt["Data"].astype("int64")

In [31]:
# Verificando o tipo de dado de cada coluna
dt.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [0]:
# Transformando coluna de "Data" em tipo data
dt["Data"] = pd.to_datetime(dt["Data"])

In [33]:
# Tipos das colunas
dt.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [34]:
# Agrupamento por ano e receita
dt.groupby(dt["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [0]:
# Criando uma nova coluna com o ano
dt["Ano_Venda"] = dt["Data"].dt.year

In [36]:
dt.sample(5)

        Cidade       Data  Vendas  ... Receita  Receita/Vendas  Ano_Venda
88   Fortaleza 2019-01-01   68.60  ...  411.60             6.0       2019
90       Natal 2019-01-02  100.54  ...  201.08             2.0       2019
140      Natal 2019-01-02   20.79  ...   41.58             2.0       2019
69    Salvador 2019-01-01   14.79  ...   14.79             1.0       2019
16     Aracaju 2018-01-01   37.68  ...  376.80            10.0       2018

[5 rows x 8 columns]

In [0]:
# Extraindo o mês e o dia
dt["Mes_Venda"], dt["Dia_Venda"] = (dt["Data"].dt.month, dt["Data"].dt.day)

In [38]:
dt.sample(5)

       Cidade       Data  Vendas  ... Ano_Venda  Mes_Venda  Dia_Venda
119   Aracaju 2018-01-01    9.32  ...      2018          1          1
136    Recife 2019-03-02   39.09  ...      2019          3          2
228  Salvador 2019-01-02    6.87  ...      2019          1          2
113  Salvador 2019-03-02   18.90  ...      2019          3          2
117  Salvador 2019-03-02   39.41  ...      2019          3          2

[5 rows x 10 columns]

In [39]:
# Retornando a data mais antiga
dt["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [0]:
# Calculando a diferença de dias
dt["Diferenca_Dias"] = dt["Data"] - dt["Data"].min()

In [41]:
dt.sample(5)

       Cidade       Data  Vendas  ... Mes_Venda  Dia_Venda  Diferenca_Dias
80   Salvador 2019-01-01   40.24  ...         1          1        365 days
184  Salvador 2019-01-02  167.16  ...         1          2        366 days
189  Salvador 2019-01-02  139.73  ...         1          2        366 days
89     Recife 2019-01-01   18.11  ...         1          1        365 days
130     Natal 2019-01-02   59.78  ...         1          2        366 days

[5 rows x 11 columns]

In [0]:
# Criando a coluna de trimestre
dt["Trimestre_Venda"] = dt["Data"].dt.quarter

In [43]:
dt.sample(5)

       Cidade       Data  Vendas  ... Dia_Venda  Diferenca_Dias  Trimestre_Venda
98   Salvador 2019-01-01  231.76  ...         1        365 days                1
27   Salvador 2019-01-01  145.79  ...         1        365 days                1
99      Natal 2019-01-02   40.38  ...         2        366 days                1
17   Salvador 2019-02-14  158.66  ...        14        409 days                1
225  Salvador 2019-01-02   36.23  ...         2        366 days                1

[5 rows x 12 columns]

In [0]:
# Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = dt.loc[(dt["Data"].dt.year == 2019) & (dt["Data"].dt.month == 3)]

In [45]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... Dia_Venda  Diferenca_Dias  Trimestre_Venda
134  Fortaleza 2019-03-02  195.18  ...         2        425 days                1
137  Fortaleza 2019-03-02   51.99  ...         2        425 days                1
42       Natal 2019-03-02  775.00  ...         2        425 days                1
125  Fortaleza 2019-03-02   37.60  ...         2        425 days                1
69       Natal 2019-03-24  817.00  ...        24        447 days                1
112     Recife 2019-03-02  133.59  ...         2        425 days                1
18       Natal 2019-03-14  581.00  ...        14        437 days                1
8        Natal 2019-03-27  667.00  ...        27        450 days                1
108     Recife 2019-03-02  152.89  ...         2        425 days                1
121   Salvador 2019-03-02  100.70  ...         2        425 days                1
132  Fortaleza 2019-03-02   17.49  ...         2        425 days                1
133     Recife 2019-03-02   14.67  ...         2        425 days                1
115     Recife 2019-03-02   12.23  ...         2        425 days                1
129  Fortaleza 2019-03-02   35.34  ...         2        425 days                1
141  Fortaleza 2019-03-02  182.75  ...         2        425 days                1
131  Fortaleza 2019-03-02  139.07  ...         2        425 days                1
117   Salvador 2019-03-02   39.41  ...         2        425 days                1
135   Salvador 2019-03-02    9.95  ...         2        425 days                1
117     Recife 2019-03-02   15.42  ...         2        425 days                1
116     Recife 2019-03-02   79.10  ...         2        425 days                1

[20 rows x 12 columns]